spicahan/qrp_companion/sdkconfig.defaults
# Target: ESP32-P4 (M5Stack Tab5)
CONFIG_IDF_TARGET="esp32p4"

# Required for 200MHz PSRAM
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# PSRAM (required by M5GFX for Tab5)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y

# Place malloc in PSRAM when internal memory is exhausted
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Compiler optimization
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# USB Host for UAC audio input
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=2048
